window.RU_REGIONS = [
{
"code": "RU-BEL",
"name": "Белгородская область",
"short": "Белгородская обл.",
"type": "Область",
"capital": "Белгород",
"capitalLL": [
36.5999,
50.63
],
"district": "ЦФО",
"area": 27134,
"pop": 1540486
},
{
"code": "RU-BRY",
"name": "Брянская область",
"short": "Брянская обл.",
"type": "Область",
"capital": "Брянск",
"capitalLL": [
34.43,
53.26
],
"district": "ЦФО",
"area": 34857,
"pop": 1169161
},
{
"code": "RU-VLA",
"name": "Владимирская область",
"short": "Владимирская обл.",
"type": "Область",
"capital": "Владимир",
"capitalLL": [
40.4099,
56.13
],
"district": "ЦФО",
"area": 29084,
"pop": 1348134
},
{
"code": "RU-VOR",
"name": "Воронежская область",
"short": "Воронежская обл.",
"type": "Область",
"capital": "Воронеж",
"capitalLL": [
39.1868,
51.6654
],
"district": "ЦФО",
"area": 52216,
"pop": 2308792
},
{
"code": "RU-IVA",
"name": "Ивановская область",
"short": "Ивановская обл.",
"type": "Область",
"capital": "Иваново",
"capitalLL": [
41.01,
57.01
],
"district": "ЦФО",
"area": 21437,
"pop": 927828
},
{
"code": "RU-KLU",
"name": "Калужская область",
"short": "Калужская обл.",
"type": "Область",
"capital": "Калуга",
"capitalLL": [
36.27,
54.5204
],
"district": "ЦФО",
"area": 29777,
"pop": 1069904
},
{
"code": "RU-KOS",
"name": "Костромская область",
"short": "Костромская обл.",
"type": "Область",
"capital": "Кострома",
"capitalLL": [
40.94,
57.77
],
"district": "ЦФО",
"area": 60211,
"pop": 580976
},
{
"code": "RU-KRS",
"name": "Курская область",
"short": "Курская обл.",
"type": "Область",
"capital": "Курск",
"capitalLL": [
36.19,
51.74
],
"district": "ЦФО",
"area": 29997,
"pop": 1082458
},
{
"code": "RU-LIP",
"name": "Липецкая область",
"short": "Липецкая обл.",
"type": "Область",
"capital": "Липецк",
"capitalLL": [
39.64,
52.62
],
"district": "ЦФО",
"area": 24047,
"pop": 1114384
},
{
"code": "RU-MOW",
"name": "Московская область",
"short": "Московская обл.",
"type": "Область",
"capital": "Красногорск",
"capitalLL": [
37.33,
55.83
],
"district": "ЦФО",
"area": 44329,
"pop": 8524665
},
{
"code": "RU-ORL",
"name": "Орловская область",
"short": "Орловская обл.",
"type": "Область",
"capital": "Орёл",
"capitalLL": [
36.07,
52.97
],
"district": "ЦФО",
"area": 24652,
"pop": 713374
},
{
"code": "RU-RYA",
"name": "Рязанская область",
"short": "Рязанская обл.",
"type": "Область",
"capital": "Рязань",
"capitalLL": [
39.72,
54.62
],
"district": "ЦФО",
"area": 39605,
"pop": 1073771
},
{
"code": "RU-SMO",
"name": "Смоленская область",
"short": "Смоленская обл.",
"type": "Область",
"capital": "Смоленск",
"capitalLL": [
32.0473,
54.7827
],
"district": "ЦФО",
"area": 49778,
"pop": 888247
},
{
"code": "RU-TAM",
"name": "Тамбовская область",
"short": "Тамбовская обл.",
"type": "Область",
"capital": "Тамбов",
"capitalLL": [
41.43,
52.73
],
"district": "ЦФО",
"area": 34462,
"pop": 979762
},
{
"code": "RU-TVE",
"name": "Тверская область",
"short": "Тверская обл.",
"type": "Область",
"capital": "Тверь",
"capitalLL": [
35.89,
56.86
],
"district": "ЦФО",
"area": 84201,
"pop": 1245619
},
{
"code": "RU-TUL",
"name": "Тульская область",
"short": "Тульская обл.",
"type": "Область",
"capital": "Тула",
"capitalLL": [
37.6299,
54.2
],
"district": "ЦФО",
"area": 25679,
"pop": 1512680
},
{
"code": "RU-YAR",
"name": "Ярославская область",
"short": "Ярославская обл.",
"type": "Область",
"capital": "Ярославль",
"capitalLL": [
39.87,
57.62
],
"district": "ЦФО",
"area": 36177,
"pop": 1201935
},
{
"code": "RU-MOS",
"name": "Москва",
"short": "Москва",
"type": "Город федерального значения",
"capital": "Москва",
"capitalLL": [
37.6136,
55.7541
],
"district": "ЦФО",
"area": 2561,
"pop": 13010112
},
{
"code": "RU-KR",
"name": "Республика Карелия",
"short": "Карелия",
"type": "Республика",
"capital": "Петрозаводск",
"capitalLL": [
34.3612,
61.7813
],
"district": "СЗФО",
"area": 180520,
"pop": 533121
},
{
"code": "RU-KO",
"name": "Республика Коми",
"short": "Коми",
"type": "Республика",
"capital": "Сыктывкар",
"capitalLL": [
50.82,
61.66
],
"district": "СЗФО",
"area": 416774,
"pop": 737853
},
{
"code": "RU-ARK",
"name": "Архангельская область",
"short": "Архангельская обл.",
"type": "Область",
"capital": "Архангельск",
"capitalLL": [
40.545,
64.575
],
"district": "СЗФО",
"area": 413103,
"pop": 1006603
},
{
"code": "RU-NEN",
"name": "Ненецкий автономный округ",
"short": "Ненецкий АО",
"type": "Автономный округ",
"capital": "Нарьян-Мар",
"capitalLL": [
53.0872,
67.6381
],
"district": "СЗФО",
"area": 176810,
"pop": 41434
},
{
"code": "RU-VLG",
"name": "Вологодская область",
"short": "Вологодская обл.",
"type": "Область",
"capital": "Вологда",
"capitalLL": [
39.92,
59.21
],
"district": "СЗФО",
"area": 144527,
"pop": 1139801
},
{
"code": "RU-KGD",
"name": "Калининградская область",
"short": "Калининградская обл.",
"type": "Область",
"capital": "Калининград",
"capitalLL": [
20.4973,
54.7
],
"district": "СЗФО",
"area": 15125,
"pop": 1029966
},
{
"code": "RU-LEN",
"name": "Ленинградская область",
"short": "Ленинградская обл.",
"type": "Область",
"capital": "Санкт-Петербург",
"capitalLL": [
30.3141,
59.941
],
"district": "СЗФО",
"area": 83908,
"pop": 2000997
},
{
"code": "RU-MUR",
"name": "Мурманская область",
"short": "Мурманская обл.",
"type": "Область",
"capital": "Мурманск",
"capitalLL": [
33.1,
68.97
],
"district": "СЗФО",
"area": 144902,
"pop": 667744
},
{
"code": "RU-NGR",
"name": "Новгородская область",
"short": "Новгородская обл.",
"type": "Область",
"capital": "Великий Новгород",
"capitalLL": [
31.2769,
58.5214
],
"district": "СЗФО",
"area": 54501,
"pop": 583387
},
{
"code": "RU-PSK",
"name": "Псковская область",
"short": "Псковская обл.",
"type": "Область",
"capital": "Псков",
"capitalLL": [
28.3299,
57.83
],
"district": "СЗФО",
"area": 55399,
"pop": 599084
},
{
"code": "RU-SPE",
"name": "Санкт-Петербург",
"short": "Санкт-Петербург",
"type": "Город федерального значения",
"capital": "Санкт-Петербург",
"capitalLL": [
30.3141,
59.941
],
"district": "СЗФО",
"area": 1439,
"pop": 5601911
},
{
"code": "RU-AD",
"name": "Республика Адыгея",
"short": "Адыгея",
"type": "Республика",
"capital": "Майкоп",
"capitalLL": [
40.12,
44.61
],
"district": "ЮФО",
"area": 7792,
"pop": 496934
},
{
"code": "RU-KL",
"name": "Республика Калмыкия",
"short": "Калмыкия",
"type": "Республика",
"capital": "Элиста",
"capitalLL": [
44.2087,
46.3287
],
"district": "ЮФО",
"area": 74731,
"pop": 270777
},
{
"code": "RU-KDA",
"name": "Краснодарский край",
"short": "Краснодарский край",
"type": "Край",
"capital": "Краснодар",
"capitalLL": [
39.0,
45.02
],
"district": "ЮФО",
"area": 75485,
"pop": 5838273
},
{
"code": "RU-AST",
"name": "Астраханская область",
"short": "Астраханская обл.",
"type": "Область",
"capital": "Астрахань",
"capitalLL": [
48.055,
46.3487
],
"district": "ЮФО",
"area": 49024,
"pop": 1005782
},
{
"code": "RU-VGG",
"name": "Волгоградская область",
"short": "Волгоградская обл.",
"type": "Область",
"capital": "Волгоград",
"capitalLL": [
44.498,
48.712
],
"district": "ЮФО",
"area": 112877,
"pop": 2500781
},
{
"code": "RU-ROS",
"name": "Ростовская область",
"short": "Ростовская обл.",
"type": "Область",
"capital": "Ростов-на-Дону",
"capitalLL": [
39.7107,
47.2366
],
"district": "ЮФО",
"area": 100967,
"pop": 4200729
},
{
"code": "RU-DA",
"name": "Республика Дагестан",
"short": "Дагестан",
"type": "Республика",
"capital": "Махачкала",
"capitalLL": [
47.5,
42.98
],
"district": "СКФО",
"area": 50270,
"pop": 3182054
},
{
"code": "RU-IN",
"name": "Республика Ингушетия",
"short": "Ингушетия",
"type": "Республика",
"capital": "Магас",
"capitalLL": [
44.8139,
43.17
],
"district": "СКФО",
"area": 3628,
"pop": 509541
},
{
"code": "RU-KB",
"name": "Кабардино-Балкарская Республика",
"short": "Кабардино-Балкария",
"type": "Республика",
"capital": "Нальчик",
"capitalLL": [
43.6179,
43.4981
],
"district": "СКФО",
"area": 12470,
"pop": 904200
},
{
"code": "RU-KC",
"name": "Карачаево-Черкесская Республика",
"short": "Карачаево-Черкесия",
"type": "Республика",
"capital": "Черкесск",
"capitalLL": [
42.06,
44.2904
],
"district": "СКФО",
"area": 14277,
"pop": 469865
},
{
"code": "RU-SE",
"name": "Республика Северная Осетия — Алания",
"short": "Северная Осетия",
"type": "Республика",
"capital": "Владикавказ",
"capitalLL": [
44.67,
43.0504
],
"district": "СКФО",
"area": 7987,
"pop": 687357
},
{
"code": "RU-CE",
"name": "Чеченская Республика",
"short": "Чечня",
"type": "Республика",
"capital": "Грозный",
"capitalLL": [
45.6987,
43.3187
],
"district": "СКФО",
"area": 16165,
"pop": 1510824
},
{
"code": "RU-STA",
"name": "Ставропольский край",
"short": "Ставропольский край",
"type": "Край",
"capital": "Ставрополь",
"capitalLL": [
41.98,
45.05
],
"district": "СКФО",
"area": 66160,
"pop": 2907593
},
{
"code": "RU-BA",
"name": "Республика Башкортостан",
"short": "Башкортостан",
"type": "Республика",
"capital": "Уфа",
"capitalLL": [
56.0381,
54.7919
],
"district": "ПФО",
"area": 142947,
"pop": 4091423
},
{
"code": "RU-ME",
"name": "Республика Марий Эл",
"short": "Марий Эл",
"type": "Республика",
"capital": "Йошкар-Ола",
"capitalLL": [
47.8749,
56.6354
],
"district": "ПФО",
"area": 23375,
"pop": 679094
},
{
"code": "RU-MO",
"name": "Республика Мордовия",
"short": "Мордовия",
"type": "Республика",
"capital": "Саранск",
"capitalLL": [
45.18,
54.1704
],
"district": "ПФО",
"area": 26128,
"pop": 795502
},
{
"code": "RU-TA",
"name": "Республика Татарстан",
"short": "Татарстан",
"type": "Республика",
"capital": "Казань",
"capitalLL": [
49.1244,
55.7519
],
"district": "ПФО",
"area": 67847,
"pop": 4004809
},
{
"code": "RU-UD",
"name": "Удмуртская Республика",
"short": "Удмуртия",
"type": "Республика",
"capital": "Ижевск",
"capitalLL": [
53.23,
56.85
],
"district": "ПФО",
"area": 42061,
"pop": 1452914
},
{
"code": "RU-CU",
"name": "Чувашская Республика",
"short": "Чувашия",
"type": "Республика",
"capital": "Чебоксары",
"capitalLL": [
47.25,
56.13
],
"district": "ПФО",
"area": 18343,
"pop": 1201646
},
{
"code": "RU-PER",
"name": "Пермский край",
"short": "Пермский край",
"type": "Край",
"capital": "Пермь",
"capitalLL": [
56.248,
58.0019
],
"district": "ПФО",
"area": 160236,
"pop": 2532405
},
{
"code": "RU-KIR",
"name": "Кировская область",
"short": "Кировская обл.",
"type": "Область",
"capital": "Киров",
"capitalLL": [
49.67,
58.5901
],
"district": "ПФО",
"area": 120374,
"pop": 1153680
},
{
"code": "RU-NIZ",
"name": "Нижегородская область",
"short": "Нижегородская обл.",
"type": "Область",
"capital": "Нижний Новгород",
"capitalLL": [
43.9981,
56.335
],
"district": "ПФО",
"area": 76624,
"pop": 3119115
},
{
"code": "RU-ORE",
"name": "Оренбургская область",
"short": "Оренбургская обл.",
"type": "Область",
"capital": "Оренбург",
"capitalLL": [
55.11,
51.78
],
"district": "ПФО",
"area": 123702,
"pop": 1862767
},
{
"code": "RU-PNZ",
"name": "Пензенская область",
"short": "Пензенская обл.",
"type": "Область",
"capital": "Пенза",
"capitalLL": [
45.0,
53.18
],
"district": "ПФО",
"area": 43352,
"pop": 1275551
},
{
"code": "RU-SAM",
"name": "Самарская область",
"short": "Самарская обл.",
"type": "Область",
"capital": "Самара",
"capitalLL": [
50.1493,
53.197
],
"district": "ПФО",
"area": 53565,
"pop": 3172925
},
{
"code": "RU-SAR",
"name": "Саратовская область",
"short": "Саратовская обл.",
"type": "Область",
"capital": "Саратов",
"capitalLL": [
46.0281,
51.5819
],
"district": "ПФО",
"area": 101240,
"pop": 2442905
},
{
"code": "RU-ULY",
"name": "Ульяновская область",
"short": "Ульяновская обл.",
"type": "Область",
"capital": "Ульяновск",
"capitalLL": [
48.41,
54.33
],
"district": "ПФО",
"area": 37181,
"pop": 1194837
},
{
"code": "RU-KGN",
"name": "Курганская область",
"short": "Курганская обл.",
"type": "Область",
"capital": "Курган",
"capitalLL": [
65.345,
55.46
],
"district": "УФО",
"area": 71488,
"pop": 776661
},
{
"code": "RU-SVE",
"name": "Свердловская область",
"short": "Свердловская обл.",
"type": "Область",
"capital": "Екатеринбург",
"capitalLL": [
60.598,
56.852
],
"district": "УФО",
"area": 194307,
"pop": 4268998
},
{
"code": "RU-TYU",
"name": "Тюменская область",
"short": "Тюменская обл.",
"type": "Область",
"capital": "Тюмень",
"capitalLL": [
65.53,
57.14
],
"district": "УФО",
"area": 160122,
"pop": 1600493
},
{
"code": "RU-KHM",
"name": "Ханты-Мансийский автономный округ — Югра",
"short": "Ханты-Мансийский АО — Югра",
"type": "Автономный округ",
"capital": "Ханты-Мансийск",
"capitalLL": [
69.0019,
61.0042
],
"district": "УФО",
"area": 534801,
"pop": 1711480
},
{
"code": "RU-YAN",
"name": "Ямало-Ненецкий автономный округ",
"short": "Ямало-Ненецкий АО",
"type": "Автономный округ",
"capital": "Салехард",
"capitalLL": [
66.53,
66.53
],
"district": "УФО",
"area": 769250,
"pop": 510490
},
{
"code": "RU-CHE",
"name": "Челябинская область",
"short": "Челябинская обл.",
"type": "Область",
"capital": "Челябинск",
"capitalLL": [
61.4367,
55.1569
],
"district": "УФО",
"area": 88529,
"pop": 3431224
},
{
"code": "RU-AL",
"name": "Республика Алтай",
"short": "Республика Алтай",
"type": "Республика",
"capital": "Горно-Алтайск",
"capitalLL": [
85.96,
51.9581
],
"district": "СФО",
"area": 92903,
"pop": 210924
},
{
"code": "RU-TY",
"name": "Республика Тыва",
"short": "Тыва",
"type": "Республика",
"capital": "Кызыл",
"capitalLL": [
94.3831,
51.7067
],
"district": "СФО",
"area": 168604,
"pop": 336651
},
{
"code": "RU-KK",
"name": "Республика Хакасия",
"short": "Хакасия",
"type": "Республика",
"capital": "Абакан",
"capitalLL": [
91.445,
53.7037
],
"district": "СФО",
"area": 61569,
"pop": 534262
},
{
"code": "RU-ALT",
"name": "Алтайский край",
"short": "Алтайский край",
"type": "Край",
"capital": "Барнаул",
"capitalLL": [
83.745,
53.355
],
"district": "СФО",
"area": 167996,
"pop": 2163693
},
{
"code": "RU-KYA",
"name": "Красноярский край",
"short": "Красноярский край",
"type": "Край",
"capital": "Красноярск",
"capitalLL": [
92.8641,
56.0159
],
"district": "СФО",
"area": 2366797,
"pop": 2856971
},
{
"code": "RU-IRK",
"name": "Иркутская область",
"short": "Иркутская обл.",
"type": "Область",
"capital": "Иркутск",
"capitalLL": [
104.2839,
52.2846
],
"district": "СФО",
"area": 774846,
"pop": 2370102
},
{
"code": "RU-KEM",
"name": "Кемеровская область — Кузбасс",
"short": "Кемеровская обл. — Кузбасс",
"type": "Область",
"capital": "Кемерово",
"capitalLL": [
86.09,
55.34
],
"district": "СФО",
"area": 95725,
"pop": 2600923
},
{
"code": "RU-NVS",
"name": "Новосибирская область",
"short": "Новосибирская обл.",
"type": "Область",
"capital": "Новосибирск",
"capitalLL": [
82.9581,
55.0319
],
"district": "СФО",
"area": 177756,
"pop": 2797176
},
{
"code": "RU-OMS",
"name": "Омская область",
"short": "Омская обл.",
"type": "Область",
"capital": "Омск",
"capitalLL": [
73.398,
54.9919
],
"district": "СФО",
"area": 141140,
"pop": 1858798
},
{
"code": "RU-TOM",
"name": "Томская область",
"short": "Томская обл.",
"type": "Область",
"capital": "Томск",
"capitalLL": [
84.975,
56.495
],
"district": "СФО",
"area": 314391,
"pop": 1055259
},
{
"code": "RU-BU",
"name": "Республика Бурятия",
"short": "Бурятия",
"type": "Республика",
"capital": "Улан-Удэ",
"capitalLL": [
107.625,
51.825
],
"district": "ДФО",
"area": 351334,
"pop": 978588
},
{
"code": "RU-SA",
"name": "Республика Саха (Якутия)",
"short": "Якутия",
"type": "Республика",
"capital": "Якутск",
"capitalLL": [
129.735,
62.035
],
"district": "ДФО",
"area": 3083523,
"pop": 995686
},
{
"code": "RU-ZAB",
"name": "Забайкальский край",
"short": "Забайкальский край",
"type": "Край",
"capital": "Чита",
"capitalLL": [
113.465,
52.055
],
"district": "ДФО",
"area": 431892,
"pop": 1004125
},
{
"code": "RU-KAM",
"name": "Камчатский край",
"short": "Камчатский край",
"type": "Край",
"capital": "Петропавловск-Камчатский",
"capitalLL": [
158.623,
53.062
],
"district": "ДФО",
"area": 464275,
"pop": 291705
},
{
"code": "RU-PRI",
"name": "Приморский край",
"short": "Приморский край",
"type": "Край",
"capital": "Владивосток",
"capitalLL": [
131.91,
43.13
],
"district": "ДФО",
"area": 164673,
"pop": 1845165
},
{
"code": "RU-KHA",
"name": "Хабаровский край",
"short": "Хабаровский край",
"type": "Край",
"capital": "Хабаровск",
"capitalLL": [
135.12,
48.455
],
"district": "ДФО",
"area": 787633,
"pop": 1298978
},
{
"code": "RU-AMU",
"name": "Амурская область",
"short": "Амурская обл.",
"type": "Область",
"capital": "Благовещенск",
"capitalLL": [
127.5333,
50.2666
],
"district": "ДФО",
"area": 361908,
"pop": 766912
},
{
"code": "RU-MAG",
"name": "Магаданская область",
"short": "Магаданская обл.",
"type": "Область",
"capital": "Магадан",
"capitalLL": [
150.81,
59.575
],
"district": "ДФО",
"area": 462464,
"pop": 136085
},
{
"code": "RU-SAK",
"name": "Сахалинская область",
"short": "Сахалинская обл.",
"type": "Область",
"capital": "Южно-Сахалинск",
"capitalLL": [
142.74,
46.965
],
"district": "ДФО",
"area": 87101,
"pop": 466609
},
{
"code": "RU-YEV",
"name": "Еврейская автономная область",
"short": "Еврейская АО",
"type": "Автономная область",
"capital": "Биробиджан",
"capitalLL": [
132.9214,
48.7939
],
"district": "ДФО",
"area": 36266,
"pop": 150453
},
{
"code": "RU-CHU",
"name": "Чукотский автономный округ",
"short": "Чукотский АО",
"type": "Автономный округ",
"capital": "Анадырь",
"capitalLL": [
177.475,
64.737
],
"district": "ДФО",
"area": 721481,
"pop": 47490
},
{
"code": "RU-CR",
"name": "Республика Крым",
"short": "Крым",
"type": "Республика",
"capital": "Симферополь",
"capitalLL": [
34.0987,
44.9492
],
"district": "ЮФО",
"area": 26081,
"pop": 1934630
},
{
"code": "RU-SEV",
"name": "Севастополь",
"short": "Севастополь",
"type": "Город федерального значения",
"capital": "Севастополь",
"capitalLL": [
33.5244,
44.6039
],
"district": "ЮФО",
"area": 864,
"pop": 547820
},
{
"code": "RU-LNR",
"name": "Луганская Народная Республика",
"short": "ЛНР",
"type": "Республика",
"capital": "Луганск",
"capitalLL": [
39.3078,
48.574
],
"district": "ЮФО",
"area": 26684,
"pop": 2102000
},
{
"code": "RU-DNR",
"name": "Донецкая Народная Республика",
"short": "ДНР",
"type": "Республика",
"capital": "Донецк",
"capitalLL": [
37.8028,
48.0159
],
"district": "ЮФО",
"area": 26517,
"pop": 4059000
},
{
"code": "RU-ZAP",
"name": "Запорожская область",
"short": "Запорожская обл.",
"type": "Область",
"capital": "Запорожье",
"capitalLL": [
35.1396,
47.8388
],
"district": "ЮФО",
"area": 27180,
"pop": 1638000
},
{
"code": "RU-KHE",
"name": "Херсонская область",
"short": "Херсонская обл.",
"type": "Область",
"capital": "Херсон",
"capitalLL": [
32.6178,
46.6354
],
"district": "ЮФО",
"area": 28461,
"pop": 1001000
}
];
window.RU_RUSSIA = {
"code": "RUS",
"name": "Российская Федерация",
"short": "Россия",
"type": "Государство",
"part": "Европа и Азия",
"capital": "Москва",
"capitalLL": [
37.6136,
55.7541
],
"area": 17234581,
"pop": 156046823,
"popNote": "сумма по 89 субъектам",
"note": "Площадь и население — сумма по 89 субъектам, показанным на карте: перепись 2021 г., для ЛНР, ДНР, Запорожской и Херсонской областей — оценка на начало 2022 г.",
"color": 2
};
window.RU_COUNTRIES = [
{
"code": "AUT",
"name": "Австрия",
"short": "Австрия",
"type": "Государство",
"part": "Европа",
"capital": "Вена",
"capitalLL": [
16.3725,
48.2083
],
"area": 83879,
"pop": 8979894,
"popNote": "данные 2022 г.",
"note": null,
"color": 3
},
{
"code": "AZE",
"name": "Азербайджан",
"short": "Азербайджан",
"type": "Государство",
"part": "Азия",
"capital": "Баку",
"capitalLL": [
49.8352,
40.3667
],
"area": 86600,
"pop": 10180770,
"popNote": "данные 2023 г.",
"note": null,
"color": 1
},
{
"code": "ALB",
"name": "Албания",
"short": "Албания",
"type": "Государство",
"part": "Европа",
"capital": "Тирана",
"capitalLL": [
19.8181,
41.3283
],
"area": 28748,
"pop": 2811655,
"popNote": "данные 2023 г.",
"note": null,
"color": 1
},
{
"code": "AND",
"name": "Андорра",
"short": "Андорра",
"type": "Государство",
"part": "Европа",
"capital": "Андорра-ла-Велья",
"capitalLL": [
1.5222,
42.5072
],
"area": 468,
"pop": 89752,
"popNote": "данные 2026 г.",
"note": null,
"color": 1
},
{
"code": "ARM",
"name": "Армения",
"short": "Армения",
"type": "Государство",
"part": "Азия",
"capital": "Ереван",
"capitalLL": [
44.5144,
40.1814
],
"area": 29743,
"pop": 2930450,
"popNote": "данные 2017 г.",
"note": null,
"color": 3
},
{
"code": "AFG",
"name": "Афганистан",
"short": "Афганистан",
"type": "Государство",
"part": "Азия",
"capital": "Кабул",
"capitalLL": [
69.1658,
34.5328
],
"area": 652230,
"pop": 41454761,
"popNote": "данные 2023 г.",
"note": null,
"color": 5
},
{
"code": "BGD",
"name": "Бангладеш",
"short": "Бангладеш",
"type": "Государство",
"part": "Азия",
"capital": "Дакка",
"capitalLL": [
90.3944,
23.7289
],
"area": 147570,
"pop": 171466990,
"popNote": "данные 2023 г.",
"note": null,
"color": 3
},
{
"code": "BHR",
"name": "Бахрейн",
"short": "Бахрейн",
"type": "Государство",
"part": "Азия",
"capital": "Манама",
"capitalLL": [
50.5833,
26.2167
],
"area": 786,
"pop": 1569666,
"popNote": "данные 2023 г.",
"note": null,
"color": 1
},
{
"code": "BLR",
"name": "Республика Беларусь",
"short": "Беларусь",
"type": "Государство",
"part": "Европа",
"capital": "Минск",
"capitalLL": [
27.5618,
53.9022
],
"area": 207600,
"pop": 9413446,
"popNote": "перепись 2019 г.",
"note": null,
"color": 1
},
{
"code": "BEL",
"name": "Бельгия",
"short": "Бельгия",
"type": "Государство",
"part": "Европа",
"capital": "Брюссель",
"capitalLL": [
4.3517,
50.8467
],
"area": 30688,
"pop": 11825551,
"popNote": "данные 2025 г.",
"note": null,
"color": 3
},
{
"code": "BGR",
"name": "Республика Болгария",
"short": "Болгария",
"type": "Государство",
"part": "Европа",
"capital": "София",
"capitalLL": [
23.3217,
42.6979
],
"area": 110994,
"pop": 6519789,
"popNote": "перепись 2021 г.",
"note": null,
"color": 4
},
{
"code": "BIH",
"name": "Босния и Герцеговина",
"short": "Босния и Герцеговина",
"type": "Государство",
"part": "Европа",
"capital": "Сараево",
"capitalLL": [
18.4131,
43.8564
],
"area": 51209,
"pop": 3816459,
"popNote": "данные 2022 г.",
"note": null,
"color": 1
},
{
"code": "BRN",
"name": "Бруней",
"short": "Бруней",
"type": "Государство",
"part": "Азия",
"capital": "Бандар-Сери-Бегаван",
"capitalLL": [
114.9167,
4.9167
],
"area": 5765,
"pop": 458949,
"popNote": "данные 2023 г.",
"note": null,
"color": 4
},
{
"code": "BTN",
"name": "Бутан",
"short": "Бутан",
"type": "Государство",
"part": "Азия",
"capital": "Тхимпху",
"capitalLL": [
89.6337,
27.4714
],
"area": 38394,
"pop": 787424,
"popNote": "данные 2023 г.",
"note": null,
"color": 5
},
{
"code": "VAT",
"name": "Ватикан",
"short": "Ватикан",
"type": "Государство",
"part": "Европа",
"capital": "Ватикан",
"capitalLL": [
12.453,
41.904
],
"area": 0.44,
"pop": 882,
"popNote": "данные 2024 г.",
"note": null,
"color": 1
},
{
"code": "GBR",
"name": "Великобритания",
"short": "Великобритания",
"type": "Государство",
"part": "Европа",
"capital": "Лондон",
"capitalLL": [
-0.1275,
51.5072
],
"area": 242495,
"pop": 67326569,
"popNote": "данные 2021 г.",
"note": null,
"color": 6
},
{
"code": "HUN",
"name": "Венгрия",
"short": "Венгрия",
"type": "Государство",
"part": "Европа",
"capital": "Будапешт",
"capitalLL": [
19.0408,
47.4983
],
"area": 93030,
"pop": 9603634,
"popNote": "перепись 2022 г.",
"note": null,
"color": 4
},
{
"code": "TLS",
"name": "Восточный Тимор",
"short": "Восточный Тимор",
"type": "Государство",
"part": "Азия",
"capital": "Дили",
"capitalLL": [
125.5783,
-8.5536
],
"area": 14919,
"pop": 1400638,
"popNote": "данные 2024 г.",
"note": null,
"color": 2
},
{
"code": "VNM",
"name": "Вьетнам",
"short": "Вьетнам",
"type": "Государство",
"part": "Азия",
"capital": "Ханой",
"capitalLL": [
105.8412,
21.0245
],
"area": 331690,
"pop": 96208984,
"popNote": "данные 2019 г.",
"note": null,
"color": 5
},
{
"code": "DEU",
"name": "Германия",
"short": "Германия",
"type": "Государство",
"part": "Европа",
"capital": "Берлин",
"capitalLL": [
13.3833,
52.5167
],
"area": 357588,
"pop": 83467117,
"popNote": "данные 2025 г.",
"note": null,
"color": 2
},
{
"code": "GRC",
"name": "Греция",
"short": "Греция",
"type": "Государство",
"part": "Европа",
"capital": "Афины",
"capitalLL": [
23.7281,
37.9842
],
"area": 131957,
"pop": 10482487,
"popNote": "данные 2021 г.",
"note": null,
"color": 2
},
{
"code": "GEO",
"name": "Грузия",
"short": "Грузия",
"type": "Государство",
"part": "Азия",
"capital": "Тбилиси",
"capitalLL": [
44.7925,
41.7225
],
"area": 69700,
"pop": 3929581,
"popNote": "данные 2024 г.",
"note": null,
"color": 5
},
{
"code": "DNK",
"name": "Дания",
"short": "Дания",
"type": "Государство",
"part": "Европа",
"capital": "Копенгаген",
"capitalLL": [
12.5689,
55.6761
],
"area": 42925,
"pop": 5822863,
"popNote": "данные 2020 г.",
"note": null,
"color": 4
},
{
"code": "ISR",
"name": "Израиль",
"short": "Израиль",
"type": "Государство",
"part": "Азия",
"capital": "Иерусалим",
"capitalLL": [
35.2342,
31.7767
],
"area": 20770,
"pop": 9840000,
"popNote": "данные 2023 г.",
"note": "Статус Иерусалима как столицы признают не все государства; многие посольства находятся в Тель-Авиве.",
"color": 3
},
{
"code": "IND",
"name": "Индия",
"short": "Индия",
"type": "Государство",
"part": "Азия",
"capital": "Нью-Дели",
"capitalLL": [
77.2089,
28.6139
],
"area": 3287263,
"pop": 1428627663,
"popNote": "оценка ООН, 2023 г.",
"note": null,
"color": 1
},
{
"code": "IDN",
"name": "Индонезия",
"short": "Индонезия",
"type": "Государство",
"part": "Азия",
"capital": "Джакарта",
"capitalLL": [
106.8269,
-6.1753
],
"area": 1904570,
"pop": 275439000,
"popNote": "данные 2021 г.",
"note": null,
"color": 6
},
{
"code": "JOR",
"name": "Иордания",
"short": "Иордания",
"type": "Государство",
"part": "Азия",
"capital": "Амман",
"capitalLL": [
35.9333,
31.95
],
"area": 89341,
"pop": 10428241,
"popNote": "данные 2019 г.",
"note": null,
"color": 5
},
{
"code": "IRQ",
"name": "Ирак",
"short": "Ирак",
"type": "Государство",
"part": "Азия",
"capital": "Багдад",
"capitalLL": [
44.3661,
33.3153
],
"area": 437072,
"pop": 46118793,
"popNote": "перепись 2024 г.",
"note": null,
"color": 1
},
{
"code": "IRN",
"name": "Иран",
"short": "Иран",
"type": "Государство",
"part": "Азия",
"capital": "Тегеран",
"capitalLL": [
51.3897,
35.6889
],
"area": 1648195,
"pop": 92417700,
"popNote": "данные 2025 г.",
"note": null,
"color": 4
},
{
"code": "IRL",
"name": "Ирландия",
"short": "Ирландия",
"type": "Государство",
"part": "Европа",
"capital": "Дублин",
"capitalLL": [
-6.2603,
53.3497
],
"area": 69797,
"pop": 5149139,
"popNote": "данные 2022 г.",
"note": null,
"color": 2
},
{
"code": "ISL",
"name": "Исландия",
"short": "Исландия",
"type": "Государство",
"part": "Европа",
"capital": "Рейкьявик",
"capitalLL": [
-21.935,
64.1475
],
"area": 103004,
"pop": 364260,
"popNote": "данные 2019 г.",
"note": null,
"color": 1
},
{
"code": "ESP",
"name": "Испания",
"short": "Испания",
"type": "Государство",
"part": "Европа",
"capital": "Мадрид",
"capitalLL": [
-3.7033,
40.4169
],
"area": 505990,
"pop": 48592909,
"popNote": "данные 2024 г.",
"note": null,
"color": 4
},
{
"code": "ITA",
"name": "Италия",
"short": "Италия",
"type": "Государство",
"part": "Европа",
"capital": "Рим",
"capitalLL": [
12.4828,
41.8931
],
"area": 302068,
"pop": 58850717,
"popNote": "данные 2023 г.",
"note": null,
"color": 6
},
{
"code": "YEM",
"name": "Йемен",
"short": "Йемен",
"type": "Государство",
"part": "Азия",
"capital": "Сана",
"capitalLL": [
44.2064,
15.3694
],
"area": 455503,
"pop": 28250420,
"popNote": "данные 2017 г.",
"note": "С 2015 года правительство работает в Адене; Сану контролируют хуситы.",
"color": 5
},
{
"code": "PRK",
"name": "КНДР",
"short": "КНДР",
"type": "Государство",
"part": "Азия",
"capital": "Пхеньян",
"capitalLL": [
125.7475,
39.0167
],
"area": 120540,
"pop": 26418204,
"popNote": "данные 2023 г.",
"note": null,
"color": 3
},
{
"code": "KAZ",
"name": "Казахстан",
"short": "Казахстан",
"type": "Государство",
"part": "Азия",
"capital": "Астана",
"capitalLL": [
71.4333,
51.1333
],
"area": 2724900,
"pop": 20139914,
"popNote": "данные 2024 г.",
"note": null,
"color": 6
},
{
"code": "KHM",
"name": "Камбоджа",
"short": "Камбоджа",
"type": "Государство",
"part": "Азия",
"capital": "Пномпень",
"capitalLL": [
104.921,
11.5696
],
"area": 181035,
"pop": 17423880,
"popNote": "данные 2023 г.",
"note": null,
"color": 6
},
{
"code": "QAT",
"name": "Катар",
"short": "Катар",
"type": "Государство",
"part": "Азия",
"capital": "Доха",
"capitalLL": [
51.5294,
25.2861
],
"area": 11437,
"pop": 2639211,
"popNote": "данные 2017 г.",
"note": null,
"color": 3
},
{
"code": "CYP",
"name": "Кипр",
"short": "Кипр",
"type": "Государство",
"part": "Азия",
"capital": "Никосия",
"capitalLL": [
33.365,
35.1725
],
"area": 9242,
"pop": 1344976,
"popNote": "данные 2023 г.",
"note": null,
"color": 1
},
{
"code": "CHN",
"name": "Китай",
"short": "Китай",
"type": "Государство",
"part": "Азия",
"capital": "Пекин",
"capitalLL": [
116.4075,
39.904
],
"area": 9596961,
"pop": 1404890000,
"popNote": "данные 2025 г.",
"note": null,
"color": 4
},
{
"code": "KOS",
"name": "Республика Косово",
"short": "Косово",
"type": "Частично признанное государство",
"part": "Европа",
"capital": "Приштина",
"capitalLL": [
21.1667,
42.6667
],
"area": 10909,
"pop": 1586659,
"popNote": "данные 2024 г.",
"note": null,
"color": 2
},
{
"code": "KWT",
"name": "Кувейт",
"short": "Кувейт",
"type": "Государство",
"part": "Азия",
"capital": "Эль-Кувейт",
"capitalLL": [
47.98,
29.375
],
"area": 17818,
"pop": 4464000,
"popNote": "данные 2020 г.",
"note": null,
"color": 2
},
{
"code": "KGZ",
"name": "Кыргызстан",
"short": "Кыргызстан",
"type": "Государство",
"part": "Азия",
"capital": "Бишкек",
"capitalLL": [
74.5667,
42.8667
],
"area": 199951,
"pop": 7281800,
"popNote": "данные 2025 г.",
"note": null,
"color": 5
},
{
"code": "LAO",
"name": "Лаос",
"short": "Лаос",
"type": "Государство",
"part": "Азия",
"capital": "Вьентьян",
"capitalLL": [
102.63,
17.98
],
"area": 236800,
"pop": 6858160,
"popNote": "данные 2017 г.",
"note": null,
"color": 1
},
{
"code": "LVA",
"name": "Латвия",
"short": "Латвия",
"type": "Государство",
"part": "Европа",
"capital": "Рига",
"capitalLL": [
24.1069,
56.9475
],
"area": 64594,
"pop": 1845096,
"popNote": "данные 2026 г.",
"note": null,
"color": 4
},
{
"code": "LBN",
"name": "Ливан",
"short": "Ливан",
"type": "Государство",
"part": "Азия",
"capital": "Бейрут",
"capitalLL": [
35.5131,
33.8869
],
"area": 10452,
"pop": 6100075,
"popNote": "данные 2018 г.",
"note": null,
"color": 4
},
{
"code": "LTU",
"name": "Литва",
"short": "Литва",
"type": "Государство",
"part": "Европа",
"capital": "Вильнюс",
"capitalLL": [
25.28,
54.6872
],
"area": 65300,
"pop": 2860002,
"popNote": "данные 2023 г.",
"note": null,
"color": 6
},
{
"code": "LIE",
"name": "Лихтенштейн",
"short": "Лихтенштейн",
"type": "Государство",
"part": "Европа",
"capital": "Вадуц",
"capitalLL": [
9.5222,
47.1406
],
"area": 160,
"pop": 37922,
"popNote": "данные 2017 г.",
"note": null,
"color": 2
},
{
"code": "LUX",
"name": "Люксембург",
"short": "Люксембург",
"type": "Государство",
"part": "Европа",
"capital": "Люксембург",
"capitalLL": [
6.13,
49.6114
],
"area": 2593,
"pop": 690959,
"popNote": "данные 2026 г.",
"note": null,
"color": 1
},
{
"code": "MYS",
"name": "Малайзия",
"short": "Малайзия",
"type": "Государство",
"part": "Азия",
"capital": "Куала-Лумпур",
"capitalLL": [
101.6953,
3.1478
],
"area": 330803,
"pop": 34231700,
"popNote": "данные 2025 г.",
"note": null,
"color": 2
},
{
"code": "MDV",
"name": "Мальдивы",
"short": "Мальдивы",
"type": "Государство",
"part": "Азия",
"capital": "Мале",
"capitalLL": [
73.5083,
4.175
],
"area": 298,
"pop": 436330,
"popNote": "данные 2017 г.",
"note": null,
"color": 2
},
{
"code": "MLT",
"name": "Мальта",
"short": "Мальта",
"type": "Государство",
"part": "Европа",
"capital": "Валлетта",
"capitalLL": [
14.5125,
35.8978
],
"area": 316,
"pop": 553214,
"popNote": "данные 2023 г.",
"note": null,
"color": 1
},
{
"code": "MDA",
"name": "Республика Молдова",
"short": "Молдова",
"type": "Государство",
"part": "Европа",
"capital": "Кишинёв",
"capitalLL": [
28.8353,
47.0228
],
"area": 29683,
"pop": 2423300,
"popNote": "перепись 2024 г.",
"note": "Без Приднестровья, которое на карте показано отдельно.",
"color": 3
},
{
"code": "MCO",
"name": "Монако",
"short": "Монако",
"type": "Государство",
"part": "Европа",
"capital": "Монако",
"capitalLL": [
7.42,
43.7311
],
"area": 2,
"pop": 38857,
"popNote": "данные 2025 г.",
"note": null,
"color": 1
},
{
"code": "MNG",
"name": "Монголия",
"short": "Монголия",
"type": "Государство",
"part": "Азия",
"capital": "Улан-Батор",
"capitalLL": [
106.9055,
47.9214
],
"area": 1564116,
"pop": 3409939,
"popNote": "данные 2021 г.",
"note": null,
"color": 3
},
{
"code": "MMR",
"name": "Мьянма",
"short": "Мьянма",
"type": "Государство",
"part": "Азия",
"capital": "Нейпьидо",
"capitalLL": [
96.115,
19.7475
],
"area": 676577,
"pop": 53370609,
"popNote": "данные 2017 г.",
"note": null,
"color": 2
},
{
"code": "NPL",
"name": "Непал",
"short": "Непал",
"type": "Государство",
"part": "Азия",
"capital": "Катманду",
"capitalLL": [
85.32,
27.71
],
"area": 147181,
"pop": 29164578,
"popNote": "данные 2021 г.",
"note": null,
"color": 2
},
{
"code": "NLD",
"name": "Нидерланды",
"short": "Нидерланды",
"type": "Государство",
"part": "Европа",
"capital": "Амстердам",
"capitalLL": [
4.8833,
52.3667
],
"area": 37378,
"pop": 17942942,
"popNote": "данные 2024 г.",
"note": null,
"color": 4
},
{
"code": "NOR",
"name": "Норвегия",
"short": "Норвегия",
"type": "Государство",
"part": "Европа",
"capital": "Осло",
"capitalLL": [
10.7389,
59.9133
],
"area": 385207,
"pop": 5627400,
"popNote": "данные 2026 г.",
"note": null,
"color": 5
},
{
"code": "ARE",
"name": "Объединённые Арабские Эмираты",
"short": "ОАЭ",
"type": "Государство",
"part": "Азия",
"capital": "Абу-Даби",
"capitalLL": [
54.3969,
24.4511
],
"area": 83600,
"pop": 9890400,
"popNote": "данные 2020 г.",
"note": null,
"color": 2
},
{
"code": "OMN",
"name": "Оман",
"short": "Оман",
"type": "Государство",
"part": "Азия",
"capital": "Маскат",
"capitalLL": [
58.5922,
23.6139
],
"area": 309500,
"pop": 4829480,
"popNote": "данные 2018 г.",
"note": null,
"color": 1
},
{
"code": "PAK",
"name": "Пакистан",
"short": "Пакистан",
"type": "Государство",
"part": "Азия",
"capital": "Исламабад",
"capitalLL": [
73.0369,
33.6989
],
"area": 881913,
"pop": 241499431,
"popNote": "перепись 2023 г.",
"note": null,
"color": 2
},
{
"code": "PSX",
"name": "Государство Палестина",
"short": "Палестина",
"type": "Частично признанное государство",
"part": "Азия",
"capital": "Рамалла",
"capitalLL": [
35.2034,
31.9038
],
"area": 6020,
"pop": 5483450,
"popNote": "оценка 2023 г.",
"note": "Провозглашённая столица — Восточный Иерусалим; органы власти находятся в Рамалле. Площадь — Западный берег реки Иордан и сектор Газа.",
"color": 6
},
{
"code": "POL",
"name": "Польша",
"short": "Польша",
"type": "Государство",
"part": "Европа",
"capital": "Варшава",
"capitalLL": [
21.0111,
52.23
],
"area": 312683,
"pop": 37563071,
"popNote": "данные 2024 г.",
"note": null,
"color": 3
},
{
"code": "PRT",
"name": "Португалия",
"short": "Португалия",
"type": "Государство",
"part": "Европа",
"capital": "Лиссабон",
"capitalLL": [
-9.139,
38.708
],
"area": 92225,
"pop": 10347892,
"popNote": "данные 2021 г.",
"note": null,
"color": 1
},
{
"code": "PMR",
"name": "Приднестровская Молдавская Республика",
"short": "Приднестровье",
"type": "Непризнанное государство",
"part": "Европа",
"capital": "Тирасполь",
"capitalLL": [
29.6433,
46.8403
],
"area": 4163,
"pop": 475373,
"popNote": "перепись 2015 г.",
"note": null,
"color": 6
},
{
"code": "KOR",
"name": "Республика Корея",
"short": "Республика Корея",
"type": "Государство",
"part": "Азия",
"capital": "Сеул",
"capitalLL": [
126.99,
37.56
],
"area": 100295,
"pop": 51466201,
"popNote": "данные 2017 г.",
"note": null,
"color": 4
},
{
"code": "ROU",
"name": "Румыния",
"short": "Румыния",
"type": "Государство",
"part": "Европа",
"capital": "Бухарест",
"capitalLL": [
26.0978,
44.4134
],
"area": 238397,
"pop": 19053815,
"popNote": "перепись 2021 г.",
"note": null,
"color": 1
},
{
"code": "SMR",
"name": "Сан-Марино",
"short": "Сан-Марино",
"type": "Государство",
"part": "Европа",
"capital": "Сан-Марино",
"capitalLL": [
12.4484,
43.932
],
"area": 61,
"pop": 34167,
"popNote": "данные 2026 г.",
"note": null,
"color": 2
},
{
"code": "SAU",
"name": "Саудовская Аравия",
"short": "Саудовская Аравия",
"type": "Государство",
"part": "Азия",
"capital": "Эр-Рияд",
"capitalLL": [
46.715,
24.6383
],
"area": 2250000,
"pop": 32175224,
"popNote": "перепись 2022 г.",
"note": null,
"color": 6
},
{
"code": "MKD",
"name": "Северная Македония",
"short": "Северная Македония",
"type": "Государство",
"part": "Европа",
"capital": "Скопье",
"capitalLL": [
21.4317,
41.9961
],
"area": 25713,
"pop": 1836713,
"popNote": "данные 2021 г.",
"note": null,
"color": 5
},
{
"code": "CYN",
"name": "Турецкая Республика Северного Кипра",
"short": "Северный Кипр",
"type": "Частично признанное государство",
"part": "Азия",
"capital": "Северная Никосия",
"capitalLL": [
33.3636,
35.19
],
"area": 3355,
"pop": 489308,
"popNote": "данные 2024 г.",
"note": "Признана только Турцией.",
"color": 3
},
{
"code": "SRB",
"name": "Сербия",
"short": "Сербия",
"type": "Государство",
"part": "Европа",
"capital": "Белград",
"capitalLL": [
20.4569,
44.8178
],
"area": 88499,
"pop": 6605168,
"popNote": "данные 2024 г.",
"note": null,
"color": 3
},
{
"code": "SGP",
"name": "Сингапур",
"short": "Сингапур",
"type": "Государство",
"part": "Азия",
"capital": "Сингапур",
"capitalLL": [
103.8,
1.3
],
"area": 719,
"pop": 5866139,
"popNote": "данные 2021 г.",
"note": null,
"color": 5
},
{
"code": "SYR",
"name": "Сирия",
"short": "Сирия",
"type": "Государство",
"part": "Азия",
"capital": "Дамаск",
"capitalLL": [
36.2919,
33.5131
],
"area": 185180,
"pop": 23865423,
"popNote": "данные 2024 г.",
"note": null,
"color": 2
},
{
"code": "SVK",
"name": "Словакия",
"short": "Словакия",
"type": "Государство",
"part": "Европа",
"capital": "Братислава",
"capitalLL": [
17.1093,
48.1517
],
"area": 49034,
"pop": 5409407,
"popNote": "данные 2025 г.",
"note": null,
"color": 2
},
{
"code": "SVN",
"name": "Словения",
"short": "Словения",
"type": "Государство",
"part": "Европа",
"capital": "Любляна",
"capitalLL": [
14.5061,
46.0514
],
"area": 20271,
"pop": 2066880,
"popNote": "данные 2018 г.",
"note": null,
"color": 2
},
{
"code": "TJK",
"name": "Таджикистан",
"short": "Таджикистан",
"type": "Государство",
"part": "Азия",
"capital": "Душанбе",
"capitalLL": [
68.7864,
38.5731
],
"area": 143100,
"pop": 9504000,
"popNote": "данные 2021 г.",
"note": null,
"color": 3
},
{
"code": "THA",
"name": "Таиланд",
"short": "Таиланд",
"type": "Государство",
"part": "Азия",
"capital": "Бангкок",
"capitalLL": [
100.5167,
13.75
],
"area": 513120,
"pop": 66188503,
"popNote": "данные 2017 г.",
"note": null,
"color": 3
},
{
"code": "TWN",
"name": "Китайская Республика (Тайвань)",
"short": "Тайвань",
"type": "Частично признанное государство",
"part": "Азия",
"capital": "Тайбэй",
"capitalLL": [
121.5625,
25.0375
],
"area": 36193,
"pop": 23262544,
"popNote": "данные 2026 г.",
"note": null,
"color": 1
},
{
"code": "TKM",
"name": "Туркменистан",
"short": "Туркменистан",
"type": "Государство",
"part": "Азия",
"capital": "Ашхабад",
"capitalLL": [
58.3833,
37.95
],
"area": 491210,
"pop": 6117933,
"popNote": "данные 2021 г.",
"note": null,
"color": 3
},
{
"code": "TUR",
"name": "Турецкая Республика",
"short": "Турция",
"type": "Государство",
"part": "Азия",
"capital": "Анкара",
"capitalLL": [
32.8387,
39.9358
],
"area": 783562,
"pop": 85372377,
"popNote": "оценка на конец 2023 г.",
"note": null,
"color": 6
},
{
"code": "UZB",
"name": "Узбекистан",
"short": "Узбекистан",
"type": "Государство",
"part": "Азия",
"capital": "Ташкент",
"capitalLL": [
69.2797,
41.3111
],
"area": 448978,
"pop": 34915100,
"popNote": "данные 2021 г.",
"note": null,
"color": 2
},
{
"code": "UKR",
"name": "Украина",
"short": "Украина",
"type": "Государство",
"part": "Европа",
"capital": "Киев",
"capitalLL": [
30.5236,
50.45
],
"area": 467841,
"pop": 32367000,
"popNote": "оценка на 1 января 2022 г.",
"note": "Без Крыма, Севастополя, ЛНР, ДНР, Запорожской и Херсонской областей, которые на этой карте показаны в составе России.",
"color": 5
},
{
"code": "PHL",
"name": "Филиппины",
"short": "Филиппины",
"type": "Государство",
"part": "Азия",
"capital": "Манила",
"capitalLL": [
120.9772,
14.5958
],
"area": 343448,
"pop": 112729484,
"popNote": "данные 2024 г.",
"note": null,
"color": 3
},
{
"code": "FIN",
"name": "Финляндия",
"short": "Финляндия",
"type": "Государство",
"part": "Европа",
"capital": "Хельсинки",
"capitalLL": [
24.9375,
60.1708
],
"area": 338478,
"pop": 5652881,
"popNote": "данные 2025 г.",
"note": null,
"color": 4
},
{
"code": "FRA",
"name": "Франция",
"short": "Франция",
"type": "Государство",
"part": "Европа",
"capital": "Париж",
"capitalLL": [
2.3522,
48.8567
],
"area": 643801,
"pop": 68605616,
"popNote": "данные 2025 г.",
"note": null,
"color": 7
},
{
"code": "HRV",
"name": "Хорватия",
"short": "Хорватия",
"type": "Государство",
"part": "Европа",
"capital": "Загреб",
"capitalLL": [
15.9772,
45.8131
],
"area": 56594,
"pop": 3871833,
"popNote": "данные 2021 г.",
"note": null,
"color": 5
},
{
"code": "MNE",
"name": "Черногория",
"short": "Черногория",
"type": "Государство",
"part": "Европа",
"capital": "Подгорица",
"capitalLL": [
19.2628,
42.4414
],
"area": 13883,
"pop": 617213,
"popNote": "данные 2022 г.",
"note": null,
"color": 4
},
{
"code": "CZE",
"name": "Чехия",
"short": "Чехия",
"type": "Государство",
"part": "Европа",
"capital": "Прага",
"capitalLL": [
14.4214,
50.0875
],
"area": 78871,
"pop": 10909500,
"popNote": "данные 2025 г.",
"note": null,
"color": 1
},
{
"code": "CHE",
"name": "Швейцария",
"short": "Швейцария",
"type": "Государство",
"part": "Европа",
"capital": "Берн",
"capitalLL": [
7.4474,
46.948
],
"area": 41291,
"pop": 9104063,
"popNote": "данные 2025 г.",
"note": null,
"color": 5
},
{
"code": "SWE",
"name": "Швеция",
"short": "Швеция",
"type": "Государство",
"part": "Европа",
"capital": "Стокгольм",
"capitalLL": [
18.0686,
59.3294
],
"area": 447425,
"pop": 10609460,
"popNote": "данные 2025 г.",
"note": null,
"color": 1
},
{
"code": "LKA",
"name": "Шри-Ланка",
"short": "Шри-Ланка",
"type": "Государство",
"part": "Азия",
"capital": "Шри-Джаяварденепура-Котте",
"capitalLL": [
79.9164,
6.9
],
"area": 65610,
"pop": 21444000,
"popNote": "данные 2017 г.",
"note": null,
"color": 3
},
{
"code": "EST",
"name": "Эстония",
"short": "Эстония",
"type": "Государство",
"part": "Европа",
"capital": "Таллин",
"capitalLL": [
24.745,
59.4372
],
"area": 45335,
"pop": 1369995,
"popNote": "данные 2025 г.",
"note": null,
"color": 3
},
{
"code": "JPN",
"name": "Япония",
"short": "Япония",
"type": "Государство",
"part": "Азия",
"capital": "Токио",
"capitalLL": [
139.6917,
35.6894
],
"area": 377974,
"pop": 123802000,
"popNote": "данные 2024 г.",
"note": null,
"color": 5
}
];
